app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "obaz"], ["email", "obaz@gmail.com"], ["password", "Obaz1234"], ["created_at", "2020-11-23 19:43:14.430486"], ["updated_at", "2020-11-23 19:43:14.430486"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "user_name" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_name", "Elor_edited"], ["password", "Ricnic123"], ["updated_at", "2020-11-23 19:25:46.290748"], ["id", 5]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)